acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
/*
********************************* (C) COPYRIGHT *******************************
 * File Name          : main.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2022/08/08
 * Description        : Main program body.
 ******************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * This software (modified or not) and binary are used for WCH MPU
 ******************************************************************************
 */

 #include "debug.h"

///--------------------------------------------------------------|
/// | CH32V003       | ST7735    | Description                   |
//---------------------------------------------------------------|
/// |                | 1 - VDD   | 3V3                           |
/// |                | 2 - GND   | GND                           |
/// | PC4            | 3 - CS    | SPI SS (Chip Select)          |
/// |                | 4 - RESET | 3V3                           |
/// | PC3            | 5 - RS    | DC (Data/Command)             |
/// | PC6 (SPI MOSI) | 6 - SDA   | MOSI (Master Output Slave In) |
/// | PC5 (SPI SCLK) | 7 - SCK   | SCLK (Serial Clock)           |
/// |                | 8 - LED   | 3V3                           |
///--------------------------------------------------------------|

#include "st7735.h"
#include <stdint.h>
#include <stdbool.h>

// Define ST7735
#define ST7735_WIDTH    160
#define ST7735_HEIGHT   128

//--------------------------------------------------------
// TIM1 CCPx register Definition
//--------------------------------------------------------
#define TIM1_CH1CVR_ADDRESS 0x40012C34  // CCR1 for CH1
#define TIM1_CH2CVR_ADDRESS 0x40012C38  // CCR2 for CH2
#define TIM1_CH3CVR_ADDRESS 0x40012C3C  // CCR3 for CH3
#define TIM1_CH4CVR_ADDRESS 0x40012C40  // CCR4 for CH4

/* Private variables */
// 48MHz /(16 *200 *62 *2) = 120Hz
#define TIM1_PSC    16   // Clock = 6MHz, SPWM = 15KHz
#define TIM1_ARR    201  // Amplitude = 0~200

#define buf_size 62    // Sine step =62 (180deg)
// Sine amplitude = 0~200 (reference =50%)
u16 sine_tbl[buf_size] = {
      5, 10, 15, 20, 25, 30, 34, 39, 44, 48,
     52, 57, 61, 65, 68, 72, 75, 79, 83, 85,
     87, 89, 91, 93, 95, 96, 97, 99, 99,100,
    100,100, 99, 99, 97, 96, 95, 93, 91, 89,
     87, 85, 83, 79, 75, 72, 68, 65, 61, 57,
     52, 48, 44, 39, 34, 30, 25, 20, 15, 10, 
      5,  0
};

// sine amplitude = 0~200 (feedback =output)
u16 sine_fdb[buf_size] = {
      5, 10, 15, 20, 25, 30, 34, 39, 44, 48,
     52, 57, 61, 65, 68, 72, 75, 79, 83, 85,
     87, 89, 91, 93, 95, 96, 97, 99, 99,100,
    100,100, 99, 99, 97, 96, 95, 93, 91, 89,
     87, 85, 83, 79, 75, 72, 68, 65, 61, 57,
     52, 48, 44, 39, 34, 30, 25, 20, 15, 10, 
      5,  0
};

//--------------------------------------------------------
// Port of the Sine PWM
//--------------------------------------------------------
// PD2 =CH1 (0~180deg High Side)
// PD0 =CH1N (0~180deg LOw Side)
// PA1 =CH2 (180~360deg High Side)
// PA2 =CH2N (180~360deg LOwh Side)
// PC2 =BRKIN (High for OCP)
// PC1 =LED for DMA Transfer Status
//--------------------------------------------------------

#define DMA_LED GPIO_Pin_1      // PC1
#define TIM1_BKIN GPIO_Pin_2    // PC2

#define TIM1_CH1 GPIO_Pin_2     // PD2
#define TIM1_CH1N GPIO_Pin_0    // PD0

#define TIM1_CH2 GPIO_Pin_1     // PA1
#define TIM1_CH2N GPIO_Pin_2    // PA2

//--------------------------------------------------------
// TIM1 init
// Timer DMA routines: TIM1_CH1(PD2) + TIM1_Dead_Time_Init
// PWM output use DMA to TIM1_CH1(CH1 =PD2, CH1N =PD0)
// (complementary output and dead time)
//--------------------------------------------------------
void TIM1_PWMOut_Init(u16 arr, u16 psc, u16 ccp)
{
    GPIO_InitTypeDef        GPIO_InitStructure = {0};
    TIM_OCInitTypeDef       TIM_OCInitStructure = {0};
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure = {0};
    TIM_BDTRInitTypeDef     TIM_BDTRInitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);

    // DMA LED =PC1, TIM1 BRKIN =PC2
    GPIO_InitStructure.GPIO_Pin = DMA_LED;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
    GPIO_SetBits(GPIOC, DMA_LED);   // DMA_LED =ON

    // TIM1 BRKIN =PC2
    GPIO_InitStructure.GPIO_Pin = TIM1_BKIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    // CH1N =PD0, CH1 =PD2,
    GPIO_InitStructure.GPIO_Pin = TIM1_CH1N | TIM1_CH1;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    // TIM1 CH2 =PA1, CH2N =PA2
    GPIO_InitStructure.GPIO_Pin = TIM1_CH2 | TIM1_CH2N;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // TIM1 Clock
    TIM_DeInit(TIM1);
    TIM_TimeBaseInitStructure.TIM_Period = arr -1;
    TIM_TimeBaseInitStructure.TIM_Prescaler = psc -1;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseInitStructure);

    // TIM1 CH1 Output =CH1 + CH1N =PD2, PD0
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;   
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;

    TIM_OCInitStructure.TIM_Pulse = ccp;  // start duty =50%
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; 
    TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_Low;  
    TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
    TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset;
    TIM_OC1Init(TIM1, &TIM_OCInitStructure);
    TIM_OC2Init(TIM1, &TIM_OCInitStructure);

    // TIM1 BRKIN =PC2, TIM1_Dead_Time
    TIM_BDTRInitStructure.TIM_OSSIState = TIM_OSSIState_Disable;
    TIM_BDTRInitStructure.TIM_OSSRState = TIM_OSSRState_Disable;
    TIM_BDTRInitStructure.TIM_LOCKLevel = TIM_LOCKLevel_OFF;

    TIM_BDTRInitStructure.TIM_DeadTime = 200;   // dead time =20us
    TIM_BDTRInitStructure.TIM_Break = TIM_Break_Enable; // external break =PC2
    TIM_BDTRInitStructure.TIM_BreakPolarity = TIM_BreakPolarity_High;
    TIM_BDTRInitStructure.TIM_AutomaticOutput = TIM_AutomaticOutput_Enable;
    TIM_BDTRConfig(TIM1, &TIM_BDTRInitStructure);

    TIM_CtrlPWMOutputs(TIM1, ENABLE);   // Enable PWM output
    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Disable);
    TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Disable);

    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE); //  Start TIM1
}

//--------------------------------------------------------
// TIM1_DMA_Init
// Initializes the TIM DMAy Channelx configuration.
//--------------------------------------------------------
void TIM1_DMA_Init(DMA_Channel_TypeDef *DMA_CHx, u32 ppadr, u32 memadr, u16 bufsize)
{
    DMA_InitTypeDef DMA_InitStructure = {0};
    NVIC_InitTypeDef NVIC_InitStructure = {0};
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    DMA_DeInit(DMA_CHx);
    DMA_InitStructure.DMA_PeripheralBaseAddr = ppadr;
    DMA_InitStructure.DMA_MemoryBaseAddr = memadr;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = bufsize;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;

    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    //DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;

    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA_CHx, &DMA_InitStructure);
    DMA_Cmd(DMA_CHx, ENABLE);

    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    DMA_ITConfig(DMA1_Channel5, DMA_IT_TC, ENABLE );
}

//--------------------------------------------------------
// interrupt for End of DMA Transfer
//--------------------------------------------------------
void DMA1_Channel5_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void DMA1_Channel5_IRQHandler(void)
{
    if(DMA_GetITStatus(DMA1_IT_TC5) != RESET )
    {
        if (GPIO_ReadOutputDataBit(GPIOC, DMA_LED) ==SET)
        {
            GPIO_ResetBits(GPIOC, DMA_LED);  // DMA LED off

            // 180~360deg Sine PWM by Sine Table
            TIM1_DMA_Init(DMA1_Channel5, (u32)TIM1_CH2CVR_ADDRESS, (u32)sine_fdb, buf_size);
        }

        else
        {
            GPIO_SetBits(GPIOC, DMA_LED);   // DMA LED on

            // 0~180deg Sine PWM by Sine Table
            TIM1_DMA_Init(DMA1_Channel5, (u32)TIM1_CH1CVR_ADDRESS, (u32)sine_fdb, buf_size);
        }
        DMA_ClearITPendingBit(DMA1_IT_TC5);
    }
}

//--------------------------------------------------------
// TIM2_INT_Init(USER_DELAY -1, 48 -1);
// TIM2 Clock =1us
//--------------------------------------------------------
void TIM2_INT_Init(u32 arr, u16 psc)
{
    TIM_TimeBaseInitTypeDef TIMBase_InitStruct;
    NVIC_InitTypeDef NVIC_InitStruct;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_DeInit(TIM2);
    TIMBase_InitStruct.TIM_Period = arr -1;
    TIMBase_InitStruct.TIM_CounterMode = TIM_CounterMode_Up;
    TIMBase_InitStruct.TIM_Prescaler = psc -1;
    TIMBase_InitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInit(TIM2, &TIMBase_InitStruct);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    NVIC_InitStruct.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 5;
    NVIC_InitStruct.NVIC_IRQChannelSubPriority = 5;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStruct);
    //TIM_Cmd(TIM2, ENABLE);  //  Start TIM2
}

// TIM1_IRQHandler handles of TIM1 interrupt
void TIM1_UP_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM1_UP_IRQHandler(void)
{
   if( TIM_GetITStatus(TIM1, TIM_IT_Update ) ==SET)
   {
       //printf( "TIM1\r\n" );
   }
   // Clear TIM1 flag
   TIM_ClearITPendingBit(TIM1, TIM_IT_Update );
}

// TIM2_IRQHandler handles of TIM2 interrupt
// Interrupt flag is set
u8 timer2_flag =0;

void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void)
{
   if (TIM_GetITStatus(TIM2, TIM_IT_Update) ==SET)
   {
       TIM_Cmd(TIM2, DISABLE);  // Stop TIM2

