acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
//---------------------------------------------------------------------
// Move Rectangle
//---------------------------------------------------------------------
void move_rect(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(WHITE);
    tft_set_cursor(0, 1);
    tft_print("8. Move Rectangle");
    Delay_Ms(1000);

    frame =260;
    uint8_t x =0, y =0, step_x =1, step_y =1;
    while (frame-- >0)
    {
        uint16_t bg = colors[rand8() % 19];
        tft_fill_rect(x, y, 80, 16, bg);
        tft_set_color(colors[rand8() %19]);

        tft_set_background_color(bg);
        tft_set_cursor(x +5, y +5);
        tft_print("Hello, World");
        Delay_Ms(1);

        x += step_x;
        if (x >= ST7735_WIDTH-80)
        {
            step_x = -step_x;
        }
        y += step_y;
        if (y >= ST7735_HEIGHT)
        {
            step_y = -step_y;
        }
    }
}

//---------------------------------------------------------------------
// ST7735 demo display
//---------------------------------------------------------------------
void demo_LCD(void)
{
    random_dot();

    scan_hline();
    scan_vline();
    random_line();

    center_rect();
    random_rect();

    fill_rect();
    move_rect();
}

//---------------------------------------------------------------------
// Init ADC1_CH7 =PD4 (10 Bit ADC)
//---------------------------------------------------------------------
void init_ADC(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    ADC_InitTypeDef  ADC_InitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div8);

    // ADC_CH7 =PD4
    ADC_DeInit(ADC1);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    // ADC1 Single channel use internal clock
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(ADC1, &ADC_InitStructure);

    // Calibration voltage
    ADC_Calibration_Vol(ADC1, ADC_CALVOL_50PERCENT);
    ADC_DMACmd(ADC1, ENABLE);
    ADC_Cmd(ADC1, ENABLE);

    // Reset Calibration
    ADC_ResetCalibration(ADC1);
    while(ADC_GetResetCalibrationStatus(ADC1));
    
    // Start Calibrartion
    ADC_StartCalibration(ADC1);
    while(ADC_GetCalibrationStatus(ADC1));
}

//---------------------------------------------------------------------
// Initializes the DMAy Channelx configuration.
// DMA_CHx - x can be 1 to 7.
// ppadr - Peripheral base address.
// memadr - Memory base address.
// bufsize - DMA channel buffer size.
//---------------------------------------------------------------------
void DMA_Tx_Init(DMA_Channel_TypeDef *DMA_CHx, u32 ppadr, u32 memadr, u16 bufsize)
{
    DMA_InitTypeDef DMA_InitStructure = {0};
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    DMA_DeInit(DMA_CHx);
    DMA_InitStructure.DMA_PeripheralBaseAddr = ppadr;
    DMA_InitStructure.DMA_MemoryBaseAddr = memadr;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = bufsize;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA_CHx, &DMA_InitStructure);
}

//---------------------------------------------------------------------
// Init DMA1-CH1 for ADC value
//---------------------------------------------------------------------
#include "ch32v00x_adc.h"
#include <stdio.h>

#define adc_buf_size (10)   // Number of average =10
u16 adc_BUF[adc_buf_size +1];

void init_DMA(void)
{
    // Init DMAx for ADC1
    DMA_Tx_Init(DMA1_Channel1, (u32)&ADC1->RDATAR, (u32)adc_BUF, adc_buf_size);
    DMA_Cmd(DMA1_Channel1, ENABLE); // Start DMA1_CH1

    // Start ADC1_CH7
    ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 1, ADC_SampleTime_30Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);     // Start

    //Delay_Ms(50);
    //ADC_SoftwareStartConvCmd(ADC1, DISABLE);    // Stop
}

//---------------------------------------------------------------------
// Single Read ADC1-CH7 (not use DMA)
//---------------------------------------------------------------------
u16 get_ADC(void)
{
    u16 val;    // 10 bit result of ADC1_CH7

    ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 1, ADC_SampleTime_30Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);

    while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));  // End of ADC?
    val = ADC_GetConversionValue(ADC1); // Read ADC vlaue
    return val;
}

//---------------------------------------------------------------------
// Display ADC-CH7 0~1023
//---------------------------------------------------------------------
u32 adc_val;
u32 mv_val;
char dec_str[9];

void disp_ADC(void)
{
    u16 i;
    u16 adc_sum =0;
    u16 ave_val;

    // read ADC buffer from DMA1
    for(i = 0; i < adc_buf_size; i++)
    {
        //adc_sum += (u32)(get_ADC());    // read direct ADC1-CH7
        adc_sum += adc_BUF[i];  // make sum by DMA1-CH1 tranfered
    }
    ave_val =adc_sum /adc_buf_size; // make average of ADC

    // Start ADC1-CH7 data DMA transfer to adc_BUF 
    DMA_Tx_Init(DMA1_Channel1, (u32)&ADC1->RDATAR, (u32)adc_BUF, adc_buf_size);
    DMA_Cmd(DMA1_Channel1, ENABLE); // Start DMA1_CH1

    adc_val =(u32)(ave_val);    // save for the feedback control
    mv_val =(ave_val *3250) /1023; // make [mV] from measured VCC value =3.25V

    tft_set_cursor(0, 88);
    tft_set_color(GREEN);
    tft_print("ADC1-CH7: ");

    // binary to 4 digit decimal as right align
    sprintf(dec_str, "%4d", mv_val);
    tft_set_cursor(54, 88);
    tft_set_color(YELLOW);
    tft_print(dec_str);

    // display unit =mV
    tft_set_cursor(84, 88);
    tft_set_color(GREEN);
    tft_print("mV");
}

